GreatCowBASIC/DATFileGenerator/incfiles/p18F57Q83.inc
;----- ADACTPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
ADACTPPS0        EQU  H'0000'
ADACTPPS1        EQU  H'0001'
ADACTPPS2        EQU  H'0002'
ADACTPPS3        EQU  H'0003'
ADACTPPS4        EQU  H'0004'
ADACTPPS0        EQU  H'0000'
ADACTPPS1        EQU  H'0001'
ADACTPPS2        EQU  H'0002'
ADACTPPS3        EQU  H'0003'
ADACTPPS4        EQU  H'0004'


;----- SPI2SCKPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
SPI2SCKPPS0      EQU  H'0000'
SPI2SCKPPS1      EQU  H'0001'
SPI2SCKPPS2      EQU  H'0002'
SPI2SCKPPS3      EQU  H'0003'
SPI2SCKPPS4      EQU  H'0004'
SPI2SCKPPS0      EQU  H'0000'
SPI2SCKPPS1      EQU  H'0001'
SPI2SCKPPS2      EQU  H'0002'
SPI2SCKPPS3      EQU  H'0003'
SPI2SCKPPS4      EQU  H'0004'


;----- SPI2SDIPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
SPI2SDIPPS0      EQU  H'0000'
SPI2SDIPPS1      EQU  H'0001'
SPI2SDIPPS2      EQU  H'0002'
SPI2SDIPPS3      EQU  H'0003'
SPI2SDIPPS4      EQU  H'0004'
SPI2SDIPPS0      EQU  H'0000'
SPI2SDIPPS1      EQU  H'0001'
SPI2SDIPPS2      EQU  H'0002'
SPI2SDIPPS3      EQU  H'0003'
SPI2SDIPPS4      EQU  H'0004'


;----- SPI2SSPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
SPI2SSPPS0       EQU  H'0000'
SPI2SSPPS1       EQU  H'0001'
SPI2SSPPS2       EQU  H'0002'
SPI2SSPPS3       EQU  H'0003'
SPI2SSPPS4       EQU  H'0004'
SPI2SSPPS0       EQU  H'0000'
SPI2SSPPS1       EQU  H'0001'
SPI2SSPPS2       EQU  H'0002'
SPI2SSPPS3       EQU  H'0003'
SPI2SSPPS4       EQU  H'0004'


;----- I2C1SDAPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
I2C1SDAPPS0      EQU  H'0000'
I2C1SDAPPS1      EQU  H'0001'
I2C1SDAPPS2      EQU  H'0002'
I2C1SDAPPS3      EQU  H'0003'
I2C1SDAPPS4      EQU  H'0004'
I2C1SDAPPS0      EQU  H'0000'
I2C1SDAPPS1      EQU  H'0001'
I2C1SDAPPS2      EQU  H'0002'
I2C1SDAPPS3      EQU  H'0003'
I2C1SDAPPS4      EQU  H'0004'


;----- I2C1SCLPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
I2C1SCLPPS0      EQU  H'0000'
I2C1SCLPPS1      EQU  H'0001'
I2C1SCLPPS2      EQU  H'0002'
I2C1SCLPPS3      EQU  H'0003'
I2C1SCLPPS4      EQU  H'0004'
I2C1SCLPPS0      EQU  H'0000'
I2C1SCLPPS1      EQU  H'0001'
I2C1SCLPPS2      EQU  H'0002'
I2C1SCLPPS3      EQU  H'0003'
I2C1SCLPPS4      EQU  H'0004'


;----- U2RXPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
U2RXPPS0         EQU  H'0000'
U2RXPPS1         EQU  H'0001'
U2RXPPS2         EQU  H'0002'
U2RXPPS3         EQU  H'0003'
U2RXPPS4         EQU  H'0004'
U2RXPPS0         EQU  H'0000'
U2RXPPS1         EQU  H'0001'
U2RXPPS2         EQU  H'0002'
U2RXPPS3         EQU  H'0003'
U2RXPPS4         EQU  H'0004'


;----- U2CTSPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
U2CTSPPS0        EQU  H'0000'
U2CTSPPS1        EQU  H'0001'
U2CTSPPS2        EQU  H'0002'
U2CTSPPS3        EQU  H'0003'
U2CTSPPS4        EQU  H'0004'
U2CTSPPS0        EQU  H'0000'
U2CTSPPS1        EQU  H'0001'
U2CTSPPS2        EQU  H'0002'
U2CTSPPS3        EQU  H'0003'
U2CTSPPS4        EQU  H'0004'


;----- U3RXPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
U3RXPPS0         EQU  H'0000'
U3RXPPS1         EQU  H'0001'
U3RXPPS2         EQU  H'0002'
U3RXPPS3         EQU  H'0003'
U3RXPPS4         EQU  H'0004'
U3RXPPS5         EQU  H'0005'
U3RXPPS0         EQU  H'0000'
U3RXPPS1         EQU  H'0001'
U3RXPPS2         EQU  H'0002'
U3RXPPS3         EQU  H'0003'
U3RXPPS4         EQU  H'0004'
U3RXPPS5         EQU  H'0005'


;----- U3CTSPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
U3CTSPPS0        EQU  H'0000'
U3CTSPPS1        EQU  H'0001'
U3CTSPPS2        EQU  H'0002'
U3CTSPPS3        EQU  H'0003'
U3CTSPPS4        EQU  H'0004'
U3CTSPPS5        EQU  H'0005'
U3CTSPPS0        EQU  H'0000'
U3CTSPPS1        EQU  H'0001'
U3CTSPPS2        EQU  H'0002'
U3CTSPPS3        EQU  H'0003'
U3CTSPPS4        EQU  H'0004'
U3CTSPPS5        EQU  H'0005'


;----- U4RXPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
U4RXPPS0         EQU  H'0000'
U4RXPPS1         EQU  H'0001'
U4RXPPS2         EQU  H'0002'
U4RXPPS3         EQU  H'0003'
U4RXPPS4         EQU  H'0004'
U4RXPPS0         EQU  H'0000'
U4RXPPS1         EQU  H'0001'
U4RXPPS2         EQU  H'0002'
U4RXPPS3         EQU  H'0003'
U4RXPPS4         EQU  H'0004'


;----- U4CTSPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
U4CTSPPS0        EQU  H'0000'
U4CTSPPS1        EQU  H'0001'
U4CTSPPS2        EQU  H'0002'
U4CTSPPS3        EQU  H'0003'
U4CTSPPS4        EQU  H'0004'
U4CTSPPS0        EQU  H'0000'
U4CTSPPS1        EQU  H'0001'
U4CTSPPS2        EQU  H'0002'
U4CTSPPS3        EQU  H'0003'
U4CTSPPS4        EQU  H'0004'


;----- U5RXPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
U5RXPPS0         EQU  H'0000'
U5RXPPS1         EQU  H'0001'
U5RXPPS2         EQU  H'0002'
U5RXPPS3         EQU  H'0003'
U5RXPPS4         EQU  H'0004'
U5RXPPS5         EQU  H'0005'
U5RXPPS0         EQU  H'0000'
U5RXPPS1         EQU  H'0001'
U5RXPPS2         EQU  H'0002'
U5RXPPS3         EQU  H'0003'
U5RXPPS4         EQU  H'0004'
U5RXPPS5         EQU  H'0005'


;----- U5CTSPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
U5CTSPPS0        EQU  H'0000'
U5CTSPPS1        EQU  H'0001'
U5CTSPPS2        EQU  H'0002'
U5CTSPPS3        EQU  H'0003'
U5CTSPPS4        EQU  H'0004'
U5CTSPPS5        EQU  H'0005'
U5CTSPPS0        EQU  H'0000'
U5CTSPPS1        EQU  H'0001'
U5CTSPPS2        EQU  H'0002'
U5CTSPPS3        EQU  H'0003'
U5CTSPPS4        EQU  H'0004'
U5CTSPPS5        EQU  H'0005'


;----- RC4I2C Bits -----------------------------------------------------
TH0              EQU  H'0000'
TH1              EQU  H'0001'
PU0              EQU  H'0004'
PU1              EQU  H'0005'
SLEW0            EQU  H'0006'
SLEW1            EQU  H'0007'
TH0              EQU  H'0000'
TH1              EQU  H'0001'
PU0              EQU  H'0004'
PU1              EQU  H'0005'
SLEW0            EQU  H'0006'
SLEW1            EQU  H'0007'
I2CTH0           EQU  H'0000'
I2CTH1           EQU  H'0001'
I2CPU0           EQU  H'0004'
I2CPU1           EQU  H'0005'
I2CSLEW0         EQU  H'0006'
I2CSLEW1         EQU  H'0007'
I2CTH0           EQU  H'0000'
I2CTH1           EQU  H'0001'
I2CPU0           EQU  H'0004'
I2CPU1           EQU  H'0005'
I2CSLEW0         EQU  H'0006'
I2CSLEW1         EQU  H'0007'


