GreatCowBASIC/DATFileGenerator/incfiles/p18F57Q83.inc
;----- CONFIG9 Options --------------------------------------------------
_BOOTPINSEL_RA4_9    EQU  H'FC'; CRC on boot output pin is RA4
_BOOTPINSEL_RA2_9    EQU  H'FD'; CRC on boot output pin is RA2
_BOOTPINSEL_RC4_9    EQU  H'FE'; CRC on boot output pin is RC4
_BOOTPINSEL_RC5_9    EQU  H'FF'; CRC on boot output pin is RC5
_BPEN_OFF_9          EQU  H'FF'; CRC on boot output pin disabled
_BPEN_ON_9           EQU  H'EF'; CRC on boot output pin enabled, selected by BOOTPINSEL<1:0>
_ODCON_OFF_9         EQU  H'FF'; Pin drives both high-going and low-going signals
_ODCON_ON_9          EQU  H'DF'; Pin drives only low-going signals

;----- CONFIG10 Options --------------------------------------------------
_CP_OFF_10           EQU  H'FF'; PFM and Data EEPROM code protection disabled
_CP_ON_10            EQU  H'FE'; PFM and Data EEPROM code protection enabled

;----- Dumping Configs 11 and higher --------------------------------------------------


;----- End of dumping Configs --------------------------------------------------


;----- DEVID Equates --------------------------------------------------
_IDLOC0            EQU  H'200002'
_IDLOC1            EQU  H'200003'
_IDLOC2            EQU  H'200004'
_IDLOC3            EQU  H'200005'
_IDLOC4            EQU  H'200006'
_IDLOC5            EQU  H'200007'
_IDLOC6            EQU  H'200008'
_IDLOC7            EQU  H'200009'
_IDLOC8            EQU  H'20000A'
_IDLOC9            EQU  H'20000B'
_IDLOC10           EQU  H'20000C'
_IDLOC11           EQU  H'20000D'
_IDLOC12           EQU  H'20000E'
_IDLOC13           EQU  H'20000F'
_IDLOC14           EQU  H'200010'
_IDLOC15           EQU  H'200011'
_IDLOC16           EQU  H'200012'
_IDLOC17           EQU  H'200013'
_IDLOC18           EQU  H'200014'
_IDLOC19           EQU  H'200015'
_IDLOC20           EQU  H'200016'
_IDLOC21           EQU  H'200017'
_IDLOC22           EQU  H'200018'
_IDLOC23           EQU  H'200019'
_IDLOC24           EQU  H'20001A'
_IDLOC25           EQU  H'20001B'
_IDLOC26           EQU  H'20001C'
_IDLOC27           EQU  H'20001D'
_IDLOC28           EQU  H'20001E'
_IDLOC29           EQU  H'20001F'
_IDLOC30           EQU  H'200020'
_IDLOC31           EQU  H'200021'
_IDLOC32           EQU  H'200022'
_IDLOC33           EQU  H'200023'
_IDLOC34           EQU  H'200024'
_IDLOC35           EQU  H'200025'
_IDLOC36           EQU  H'200026'
_IDLOC37           EQU  H'200027'
_IDLOC38           EQU  H'200028'
_IDLOC39           EQU  H'200029'
_IDLOC40           EQU  H'20002A'
_IDLOC41           EQU  H'20002B'
_IDLOC42           EQU  H'20002C'
_IDLOC43           EQU  H'20002D'
_IDLOC44           EQU  H'20002E'
_IDLOC45           EQU  H'20002F'
_IDLOC46           EQU  H'200030'
_IDLOC47           EQU  H'200031'
_IDLOC48           EQU  H'200032'
_IDLOC49           EQU  H'200033'
_IDLOC50           EQU  H'200034'
_IDLOC51           EQU  H'200035'
_IDLOC52           EQU  H'200036'
_IDLOC53           EQU  H'200037'
_IDLOC54           EQU  H'200038'
_IDLOC55           EQU  H'200039'
_IDLOC56           EQU  H'20003A'
_IDLOC57           EQU  H'20003B'
_IDLOC58           EQU  H'20003C'
_IDLOC59           EQU  H'20003D'
_IDLOC60           EQU  H'20003E'
_IDLOC61           EQU  H'20003F'

        LIST
